# Week-5 Assignment: Grouping, Merging, and Time-Series with Pandas

In [1]:
import pandas as pd

## 1. Grouping and Aggregation (20 Marks)

You are provided with the following dataset about employees and their sales performance:

“”””import pandas as pd

data = {

    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data) “”””

Perform the following tasks:

1. Group the data by Employee and calculate the total sales for each employee. (5 Marks)
2. Group the data by Region and find the average sales per region. (5 Marks)
3. Group the data by both Employee and Year to calculate the total sales for each combination. (10 Marks)

In [2]:
data = {
    'Employee': ['Alice', 'Bob', 'Alice', 'Bob', 'Charlie', 'Alice', 'Charlie', 'Bob'],
    'Region': ['North', 'South', 'North', 'South', 'North', 'South', 'North', 'North'],
    'Sales': [200, 150, 300, 400, 100, 250, 300, 350],
    'Year': [2023, 2023, 2024, 2024, 2023, 2024, 2024, 2023]
}

df = pd.DataFrame(data)

In [4]:
df.head(8)

  Employee Region  Sales  Year
0    Alice  North    200  2023
1      Bob  South    150  2023
2    Alice  North    300  2024
3      Bob  South    400  2024
4  Charlie  North    100  2023
5    Alice  South    250  2024
6  Charlie  North    300  2024
7      Bob  North    350  2023

In [6]:
# 1.Group the data by Employee and calculate the total sales for each employee. (5 Marks)
# solution:
df.groupby("Employee").sum()

          Sales  Year
Employee
Alice       750  6071
Bob         900  6070
Charlie     400  4047

In [7]:
# 2. Group the data by Region and find the average sales per region. (5 Marks)
# solution:
df.groupby("Region").mean()

             Sales         Year
Region
North   250.000000  2023.400000
South   266.666667  2023.666667

In [8]:
# 3. Group the data by both Employee and Year to calculate the total sales for each combination. 
# solution:
df.groupby(['Employee','Year']).sum()

               Sales
Employee Year
Alice    2023    200
         2024    550
Bob      2023    500
         2024    400
Charlie  2023    100
         2024    300

# 2. Merging and Concatenation (20 Marks)
You are provided with two datasets containing employee details and sales targets:

employee_details = pd.DataFrame({

    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})

sales_targets = pd.DataFrame({

    'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
    'Sales_Target': [1000, 1200, 800, 500]
})

Perform the following tasks:

1. Merge the two datasets on the Employee column to combine all details. (10 Marks)
2. Create a new column showing the difference between Sales_Target and total sales (calculated from Task 1). Hint: Use the merged dataset for calculations. (10 Marks)

In [10]:
employee_details = pd.DataFrame({

'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
'Age': [25, 30, 35, 40],
'Department': ['Sales', 'Sales', 'Marketing', 'HR']
})

sales_targets = pd.DataFrame({

'Employee': ['Alice', 'Bob', 'Charlie', 'David'],
'Sales_Target': [1000, 1200, 800, 500]
})

In [18]:
# 1. Merge the two datasets on the Employee column to combine all details. (10 Marks)
# solution:
df1 = employee_details.merge(sales_targets)
df1

  Employee  Age Department  Sales_Target
0    Alice   25      Sales          1000
1      Bob   30      Sales          1200
2  Charlie   35  Marketing           800
3    David   40         HR           500

In [17]:
# Alternative solution
# df1 = employee_details.join(sales_targets,lsuffix='_em',rsuffix='_sale')
# df1

  Employee_em  Age Department Employee_sale  Sales_Target
0       Alice   25      Sales         Alice          1000
1         Bob   30      Sales           Bob          1200
2     Charlie   35  Marketing       Charlie           800
3       David   40         HR         David           500

In [20]:
# 2. Create a new column showing the difference between Sales_Target and total sales (calculated from Task 1). Hint: Use the merged dataset for calculations. (10 Marks)
# solution:
df1['Difference'] = (df1['Sales_Target'].sum()) - df1['Sales_Target'] 
df1

  Employee  Age Department  Sales_Target  Difference
0    Alice   25      Sales          1000        2500
1      Bob   30      Sales          1200        2300
2  Charlie   35  Marketing           800        2700
3    David   40         HR           500        3000

# 3. Working with Time-Series Data (20 Marks)

The following dataset contains daily stock prices:

stock_prices = pd.DataFrame({

    'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
    'Price': [100, 102, 105, 107, 110]
})

Perform the following tasks:
1. Convert the Date column to a datetime object. (5 Marks)
2. Resample the data to calculate the weekly average price. (10 Marks)
3. Find the day with the highest stock price. (5 Marks)

In [21]:
stock_prices = pd.DataFrame({

'Date': ['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04', '2024-01-05'],
'Price': [100, 102, 105, 107, 110]
})

In [23]:
# 1. Convert the Date column to a datetime object. (5 Marks)
# solution:
stock_prices['datetime'] = pd.to_datetime(stock_prices['Date'])
stock_prices

         Date  Price   datetime
0  2024-01-01    100 2024-01-01
1  2024-01-02    102 2024-01-02
2  2024-01-03    105 2024-01-03
3  2024-01-04    107 2024-01-04
4  2024-01-05    110 2024-01-05

In [24]:
stock_prices.dtypes

Date                object
Price                int64
datetime    datetime64[ns]
dtype: object

In [27]:
# 2.Resample the data to calculate the weekly average price. (10 Marks)
# solution:
stock_prices.set_index('datetime',inplace=True)
stock_prices_weekly = stock_prices['Price'].resample('W').mean()
stock_prices_weekly

datetime
2024-01-07    104.8
Freq: W-SUN, Name: Price, dtype: float64

In [43]:
# 3. Find the day with the highest stock price.
# solution:
max_price = stock_prices['Price'].max()
highest_price_day = stock_prices.loc[(stock_prices['Price']==max_price)].index[0]
print(highest_price_day)

2024-01-05 00:00:00

In [38]:
# Alternative solution:
stock_prices['Price'].idxmax()

Timestamp('2024-01-05 00:00:00')

# 4. Pivot Tables and Cross-Tabulations (20 Marks)

Using the original df dataset from Task 1:
1. Create a pivot table to find the total sales by Region and Year. (10 Marks)
2. Create a cross-tabulation showing the count of employees working in each Region for each Year. (10 Marks)

In [44]:
# 1. Create a pivot table to find the total sales by Region and Year. (10 Marks)
# solution:
table = pd.pivot_table(df, index=['Region','Year'])
table

                  Sales
Region Year
North  2023  216.666667
       2024  300.000000
South  2023  150.000000
       2024  325.000000

In [51]:
# 2. Create a cross-tabulation showing the count of employees working in each Region for each Year. (10 Marks)
# solution:
pd.crosstab(df['Employee'], [df['Region'],df['Year']],rownames=['Employee'], colnames=['Region', 'Year'])

Region   North      South
Year      2023 2024  2023 2024
Employee
Alice        1    1     0    1
Bob          1    0     1    1
Charlie      1    1     0    0

# 5. Exporting Data (10 Marks)

1. Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv. (5 Marks)
2. Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx. (5 Marks)

In [54]:
# 1. Save the final merged dataset (from Task 2) to a CSV file named employee_sales.csv. (5 Marks)
# solution:
new1 = df1.to_csv('employee_sales.csv')
new1

In [55]:
# 2. Save the pivot table (from Task 4) to an Excel file named sales_summary.xlsx. (5 Marks)
# solution:
new2 = table.to_excel('sales_summary.xlsx')
new2